Readme update + tool extension fixes
